{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 150, 150, 3], "trainable": true, "input_dtype": "float32", "bias": true, "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "name": "block1_conv1", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block1_conv2", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block2_conv1", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 128}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block2_conv2", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 128}}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block3_conv1", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 256}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block3_conv2", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 256}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block3_conv3", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 256}}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block4_conv1", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block4_conv2", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block4_conv3", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block5_conv1", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block5_conv2", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "bias": true, "name": "block5_conv3", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_filter": 512}}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"input_dtype": "float32", "name": "flatten_1", "batch_input_shape": [null, 4, 4, 512], "trainable": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, true], "trainable": true, "output_dim": 256, "input_dtype": "float32", "b_regularizer": null, "bias": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "name": "dense_1", "b_constraint": null, "init": "uniform", "activation": "linear", "input_dim": true, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "b_regularizer": null, "bias": true, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "uniform", "activation": "linear", "input_dim": null, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "sigmoid"}}]}], "keras_version": "1.0.6"}