{"class_name": "Sequential", "keras_version": "1.0.6", "config": [{"class_name": "ZeroPadding2D", "config": {"batch_input_shape": [null, 150, 150, 3], "name": "zeropadding2d_13", "trainable": true, "input_dtype": "float32", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "init": "uniform", "nb_filter": 32, "name": "conv1", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_13", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_14", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "init": "uniform", "nb_filter": 32, "name": "conv2", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_14", "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_15", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "init": "uniform", "nb_filter": 64, "name": "conv3", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_15", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, true], "bias": true, "W_regularizer": {"name": "WeightRegularizer", "l1": 0.0, "l2": 0.009999999776482582}, "activation": "linear", "output_dim": 64, "trainable": true, "input_dtype": "float32", "name": "dense_8", "input_dim": true}}, {"class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "uniform", "name": "dense_9", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 1, "trainable": true, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "sigmoid"}}]}