{"keras_version": "1.0.6", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 4, 4, 512], "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, true], "name": "dense_1", "b_regularizer": null, "W_constraint": null, "output_dim": 256, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "bias": true, "activity_regularizer": null, "input_dim": true, "init": "uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "trainable": true, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null, "init": "uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}]}